package learning.D_operators;

// TODO: Исправьте ошибки и выполните задания
public class Practice {
    public static void main(String[] args) {
        System.out.println("Practice D started!");

        // ЗАДАЧА 1: Исправить поведение программы
        // int a = 5;
        // int b = 2;
        // double result = a / b; // ВНИМАНИЕ: Деление целых чисел происходит ДО присваивания double
        // System.out.println(result); // Выведет 2.0, а не 2.5! Исправьте, чтобы было 2.5

        // ЗАДАЧА 2: Проверка на четность
        int number = 15;
        // Напишите boolean выражение, которое true, если number четное (используйте остаток от деления)
        // boolean isEven = ...;

        // ЗАДАЧА 3: Сравнение строк
        String pass1 = "password";
        String pass2 = "pass" + "word";
        // Допишите условие для правильного сравнения строк
        // if (pass1 ... pass2) { System.out.println("Access granted"); }

        // ЗАДАЧА 4: Логика
        boolean hasLicense = true;
        boolean isSober = false;
        // Напишите условие: можно водить, ТОЛЬКО если есть права И трезвый
        // if (...)
    }
}
