package tasks;

public class FizzBuzz {
    public static void main(String[] args) {
        // ЗАДАЧА: FizzBuzz
        // Напишите программу, которая выводит числа от 1 до 100.
        // Но для кратных трём (3, 6, 9...) выводите "Fizz" вместо числа.
        // Для кратных пяти (5, 10, 15...) выводите "Buzz".
        // Для чисел, кратных и трём, и пяти (15, 30...), выводите "FizzBuzz".

        // Пример вывода:
        // 1
        // 2
        // Fizz
        // 4
        // Buzz
        // Fizz
        // ...
        // 14
        // FizzBuzz
        // 16

        System.out.println("FizzBuzz task started! Write your solution below.");

        // ВАШ КОД ЗДЕСЬ:

    }
}
